export const DEFINITIONS = {
  globe: {
    title: "تعریف اول",
    content: `یک متر = \\(\\frac{1}{10{,}000{,}000}\\) فاصله قطب تا استوا`,
  },

  platinumBar: {
    title: "تعریف دوم",
    content:
      "متر به صورت فاصله بین دو خراش در دو سر یک میله از جنس پلاتین-ایریدیم تعریف شد که در اداره بین‌المللی اوزان و مقیاس‌ها در پاریس نگهداری می‌شد و نمونه‌های دقیقی به آزمایشگاه‌های سراسر جهان فرستاده شد.",
  },

  wave: {
    title: "تعریف سوم",
    content: `یک متر = \\(1{,}650{,}763.73\\) طول موج`,
  },

  light: {
    title: "تعریف چهارم",
    content: `یک متر = \\(\\frac{1}{299{,}792{,}458}\\) ثانیه نوری`,
  },

  cylinder: {
    title: "استوانه پلاتین ایریدیم",
    content:
      "استاندارد جرم استوانه‌ی پلاتین-ایریدیوم است که در اداره‌ی بین‌المللی اوزان و مقیاس‌ها در پاریس نگهداری می‌شود. بنابراین توافق شد جرم ۱ کیلوگرم به آن اختصاص داده شود.",
  },
  amu: {
    title: "واحد جرم اتمی",
    content:
      "جرم اتم ها را میتوان به جای مقایسه با استاندارد کیلوگرم به طور دقیق تری مقایسه کرد. برای این منظور یک استاندارد ثانویه برای جرم داریم که این استاندارد اتم کربن ۱۲ است. یک واحد جرم اتمی برابر است با یک دوازدهم جرم اتم کربن ۱۲. بنابراین یک واحد جرم اتمی برابر است با \\(1.66053906660 \\times 10^{-27}\\) کیلوگرم.",
  },
};

export const UNIT_TABS = [
  { id: "earth", label: "🌍 قطب تا استوا" },
  { id: "bar", label: "📏 میله پلاتین" },
  { id: "atom", label: "⚛️ اتم" },
  { id: "light", label: "💡 نور" },
];

export const TOP_LEVEL_TABS = [
  { id: "whiteboard", label: "📝 وایت برد" },
  { id: "length", label: "طول" },
  { id: "mass", label: "جرم" },
  { id: "time", label: "زمان" },
];
